Revit 2027 API
ExternalResourceReference.Version Property
 The version of the external data that was most recently loaded in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Version { get; }
Public ReadOnly Property Version As String
	Get
public:
property String^ Version {
	String^ get ();
}
member Version : string with get
Property Value
String
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace